[
  {
    "course_id": "6357c0e1ef7febb992bb9740",
    "category_id": "01",
    "course_title": "Space And Time",
    "course_duration": 6,
    "course_details": "This online course is asynchronous, giving you the flexibility to complete weekly activities at your own pace. Essays, written by our authoring scientists, are supplemented by case studies, textbook readings, videos, interactive simulations, image galleries, and more. These resources provide the foundation for assignments as well as online discussions where you will exchange questions and ideas with course faculty and other learners. The course culminates in a final project, which is your opportunity to create activities that you can use with your students.",
    "course_image": "https://www.amnh.org/var/ezflow_site/storage/images/media/amnh/images/learn-teach/sos-images/courses/top-image/sos-course-space-time-and-motion-top_2x/2267895-1-eng-US/sos-course-space-time-and-motion-top_2x_facebookshare_1200.jpg",
    "course_content": ""
  },
  {
    "course_id": "6357c0e18f06d83b5d95563a",
    "category_id": "01",
    "course_title": "Thermodynamics",
    "course_duration": 8,
    "course_details": "This course provides an introduction to the most powerful engineering principles you will ever learn - Thermodynamics: the science of transferring energy from one place or form to another place or form. We will introduce the tools you need to analyze energy systems from solar panels, to engines, to insulated coffee mugs. More specifically, we will cover the topics of mass and energy conservation principles; first law analysis of control mass and control volume systems; properties and behavior of pure substances; and applications to thermodynamic systems operating at steady state conditions.",
    "course_image": "https://i.ytimg.com/vi/ddm-lWN6r7M/maxresdefault.jpg",
    "course_content": ""
  },
  {
    "course_id": "6357c0e13a2cb6fb69886236",
    "category_id": "01",
    "course_title": "Quantum Physics",
    "course_duration": 3,
    "course_details": "This course covers the experimental basis of quantum physics. It introduces wave mechanics, Schrödinger's equation in a single dimension, and Schrödinger's equation in three dimensions. It is the first course in the undergraduate Quantum Physics sequence, followed by 8.05 Quantum Physics II and 8.06 Quantum Physics III. We will cover the whole band width of quantum mechanics starting from the initial experimental observations and ending up with relativistic quantum theory. Quantum mechanics is arguably among the most fascinating fields of science. It has made numerous appearances in modern pop-culture and is present in our everyday lives. Still, it is also very challenging to get a grasp at this topic - even understanding the most fundamental concepts can be very difficult without instructions. However, I think that this most fascinating field of science is often taught either too vague or with a too strong focus on the mathematics. Instead of watching random Youtube videos or going through hundred of hours of university courses, I think that Udemy courses are a nice platform for purposeful learning. You are kindly invited to join this carefully prepared course that will teach you the 101 of quantum physics.",
    "course_image": "https://i.ytimg.com/vi/hOiUcdgBwKw/maxresdefault.jpg",
    "course_content": ""
  },
  {
    "course_id": "6357c0e1e6bfef53a381baea",
    "category_id": "01",
    "course_title": "Nuclear Physics",
    "course_duration": 11,
    "course_details": " Nuclear Energy: Science Systems and Society, designed to introduce students to the foundations of nuclear reactions and their effects on processes we use every day for energy, work, or discovery. Students will learn about magnetic fusion energy research and can explore MIT's reactor virtually. Another course option is Understanding Nuclear Energy from Delftx. Students will study concepts of radiation and radioactivity, nuclear energy implementation, and how we might make this fission reaction safer and more efficient in accelerator facilities for human use. The course will explore making nuclear emissions safe world-wide. From neutron stars and photons to the nucleons and neutrinos found in everything we see, nuclear physics offers us the chance to understand how things work on the micro-level. Courses from edX can help students explore the hidden pieces of our universe. ",
    "course_image": "https://i.ytimg.com/vi/dknLglBM-xA/maxresdefault.jpg",
    "course_content": ""
  },
  {
    "course_id": "6357c0e14256ff2227ed5a81",
    "category_id": "02",
    "course_title": "Linear Algebra",
    "course_duration": 6,
    "course_details": "This is a basic subject on matrix theory and linear algebra. Emphasis is given to topics that will be useful in other disciplines, including systems of equations, vector spaces, determinants, eigenvalues, similarity, and positive definite matrices. Take free online linear algebra courses to build your skills and advance your career. Learn linear algebra and other in-demand subjects with courses from top universities and institutions around the world on edX. Become familiar with linear combination, matrix multiplication, vector space, eigenvectors, and much more. Get an introduction to linear algebra with online courses from major universities and institutions. Edx offers beginner and advanced courses designed to help you learn about linear algebra in an engaging and effective online learning environment complete with video tutorials, quizzes and more. Additionally, students can earn verified certificates in linear algebra and other mathematics disciplines from edX and the university offering the course, proof for teachers, employers and others of successful completion of the coursework. Get started in linear algebra with one the following courses or programs.",
    "course_image": "https://pll.harvard.edu/sites/default/files/styles/social_share/public/course/APMA_MATH_2.jpg?itok=BXdD2C6-",
    "course_content": ""
  },
  {
    "course_id": "6357c0e143ab89b7edad43a7",
    "category_id": "02",
    "course_title": "Abstract Algebra",
    "course_duration": 12,
    "course_details": "This course is designed to facilitate understanding of basic concepts and properties of algebraic structures. The topics include Groups, Subgroups, Cyclic Groups, Permutation Groups, Cosets, Isomorphism, Normal and Factor Groups, Homomorphism, and introduction to rings.",
    "course_image": "https://robotics.umich.edu/wp-content/uploads/2020/07/ROB101-landscape-clena-copy@4x-100-1024x512.jpg",
    "course_content": ""
  },
  {
    "course_id": "6357c0e1bfc90f3346b16a63",
    "category_id": "02",
    "course_title": "Calculus I",
    "course_duration": 2,
    "course_details": "Get an introduction to calculus with online courses from major universities and institutions worldwide including Harvard, MIT and TU Delft. We offer basic calculus courses and advanced programs designed to help you learn calculus in an engaging and effective online learning environment complete with video tutorials, calculus problems, quizzes and more. Additionally, students can earn verified certificates in calculus and other mathematics disciplines from edX and the university offering the course, proof for teachers, employers and others of successful completion of the coursework. Get started learning calculus with one the following courses or programs. If you are ready for advanced calculus, check out Calculus Applied! from Harvard University. This exciting course will teach you how to apply the tools of calculus to real-world analysis. Through a series of case studies, you will look at how test makers use calculus functions to analyze test questions, how economists model price and demand using rates of change and much more. See calculus come to life with real practitioners guiding you along the way. The course is free to audit or students can pursue a certificate for a small fee.",
    "course_image": "https://www.cmuse.org/wp-content/uploads/2020/06/learn-calculus-lessons-online.jpg",
    "course_content": ""
  },
  {
    "course_id": "6357c0e1e674cba59040868a",
    "category_id": "02",
    "course_title": "Calculus II",
    "course_duration": 10,
    "course_details": "Calculus II covers techniques and applications of integration, exponential and logarithmic functions, parametric equations and infinite sequences and series. You'll take this online course at your own pace. Some students thrive in this environment, while other students may struggle with setting their own deadlines. If you have successfully taken an independent study or correspondence course previously, enroll anytime courses may be right for you. Still not sure? Take our online quiz to help determine if online enroll anytime courses are right for you. Course information including tuition, technology requirements, textbooks, lessons and exams is subject to change without notice.",
    "course_image": "https://s3.amazonaws.com/prod.static-content.quillette.com/2022/09/Math--1-.png",
    "course_content": ""
  },
  {
    "course_id": "6357c0e1647955445efb6626",
    "category_id": "03",
    "course_title": "Python",
    "course_duration": 10,
    "course_details": "Python is a general-purpose, versatile, and powerful programming language. It's a great first language because Python code is concise and easy to read. Whatever you want to do, python can do it. From web development to machine learning to data science, Python is the language for you. See why millions of people turn to ours real-world experts to learn Python. Learn at your own pace with hands-on exercises and quizzes. Our courses are frequently updated so you'll always be working from the latest information. This is the training you'll need to become a professional Python developer.",
    "course_image": "https://makeawebsitehub.com/wp-content/uploads/2016/02/learn-code-e1455713167295.jpg",
    "course_content": ""
  },
  {
    "course_id": "6357c0e14261b771f32a0eed",
    "category_id": "03",
    "course_title": "R and Software Development",
    "course_duration": 8,
    "course_details": "R is a programming language and a free software environment for statistical computing and graphics, widely used by data analysts, data scientists and statisticians. This Specialization covers R software development for building data science tools. As the field of data science evolves, it has become clear that software development skills are essential for producing and scaling useful data science results and products. This Specialization will give you rigorous training in the R language, including the skills for handling complex data, building R packages, and developing custom data visualizations. You'll be introduced to indispensable R libraries for data manipulation, like tidyverse, and data visualization and graphics, like ggplot2. You'll learn modern software development practices to build tools that are highly reusable, modular, and suitable for use in a team-based environment or a community of developers. ",
    "course_image": "https://cdn.mos.cms.futurecdn.net/9QTpESGBXa32D29J77VR3d-1200-80.jpg",
    "course_content": ""
  },
  {
    "course_id": "6357c0e10958671f9ab0501e",
    "category_id": "03",
    "course_title": "Fundamentals of Java Programming",
    "course_duration": 6,
    "course_details": "The curriculum introduces programmers to foundational concepts including methods, arrays, and lists. Object-oriented programming and design utilizing inheritance, polymorphism, and abstraction will also be covered in this principal course. This course aims to provide beginning programmers with a basic understanding of the Java language and tools as well as object-oriented programming and design. Your career as a program developer starts here. Gain entry-level programing skills in Java language, and prepare yourself to handle any task that is required in any programming job.",
    "course_image": "https://i.pcmag.com/imagery/articles/03mYCJkIdptJX1Soh08tBzt-1..v1630572092.jpg",
    "course_content": ""
  },
  {
    "course_id": "6357c0e10c6c40da05cf72c3",
    "category_id": "03",
    "course_title": "Web Development or Full Stack Developer",
    "course_duration": 4,
    "course_details": "Full stack web development refers to the process of developing both client- and server-side software. That means you can expect anyone with 'full stack' included in their job title to have expertise in several front- and backend languages and frameworks. On the frontend, mastery in HTML and CSS is a common requirement for the field. Developers also tend to use JavaScript, jQuery, or Angular when developing a browser platform. Concerning the backend, full stack development consists of programming servers and databases. A server might call for code in PHP, ASP, Python, or Node, while a database can accept languages like SQL, SQLite, or MongoDB. The first four courses cover front end technologies including HTML, CSS, Vanilla JavaScript, React, and D3. The backend end development, relational database course, and quality assurance certifications cover Node, Express, SQL, testing with Chai, MongoDB and more.",
    "course_image": "https://blog.techliance.com/wp-content/uploads/2020/09/What-is-Full-Stack-Development.jpg",
    "course_content": ""
  },
  {
    "course_id": "6357c0e196ed45d9371cc485",
    "category_id": "04",
    "course_title": "Fundamentals of Electrical Engineering.",
    "course_duration": 3,
    "course_details": "This course provides a complete overview of electric circuit analysis used in electrical engineering and electronics engineering. Electric circuit analysis is the most fundamental concept for electrical, electronics, and computer engineering. This course is mainly for undergraduate students but starts from a very basic level which makes it very easier for beginners as well. This course will introduce and explain the fundamental concepts of basic electrical engineering. The basic concepts of DC and AC (Single Phase and Three Phase Circuits) Circuit Analysis, Construction and working of transformers, steady-state and phase analysis of AC networks, series and parallel and know how to calculate equivalent resistance for these circuits. Ohm's and Kirchhoff's law and Nodal and Mesh Analysis by using KCL and KVL for Solving Electrical Circuits. By the end of the course, the students should be able to gather high-quality knowledge of basic electrical engineering.",
    "course_image": "https://www.york.ac.uk/media/study/courses/undergraduate/electronics/Ee-comp-BEng.jpg",
    "course_content": ""
  },
  {
    "course_id": "6357c0e153ab47ce02d4a88a",
    "category_id": "04",
    "course_title": "Electromechanics.",
    "course_duration": 12,
    "course_details": "A microcontroller is a small computer contained on a single metal oxide semiconductor integrated circuit chip. It's less sophisticated than a system on a chip (SOC) and is used primarily with automated devices in the world of IoT. Microcontrollers are the brains for relatively simple devices and contains a CPU, input/output peripherals, and memory processing all on a single chip. It's straightforward and drives the control and operation of office machines, robots, medical equipment, and other devices in embedded systems. The microchip (MCU) is low power and doesn't have the complexity of microprocessors. However, it can provide real time operation and data. They're a cost-effective way to power IoT and edge computing devices because of its low power operation. Most are able to wait for an event such as a stop press with a small power supply. With the rise of edge computing and IoT, these MCUs can provide power and operation within a small space. A knowledge of microcontroller units allows you to build a career exploring the farthest reaches of these devices and their operation. EdX.org offers courses in partnership with leading institutions in the field. You'll learn skills related to IoT and edge computing and their components, allowing you to build a rewarding career in research and innovation.",
    "course_image": "https://as2.ftcdn.net/v2/jpg/01/82/44/87/1000_F_182448740_7RUmko1XxrVgNqoABnydponFTyu1wKUu.jpg",
    "course_content": ""
  },
  {
    "course_id": "6357c0e16c6b76a1af5c1e19",
    "category_id": "04",
    "course_title": "Analog and Digital Electrical Circuits",
    "course_duration": 11,
    "course_details": "The course gives an introduction to analysis of elementary analog and digital circuits. It will give an basis for understanding and constructing simple systems of analog and digital electronic circuit elements. Central themes: Current and voltage, Kirchhoff's laws, methods of analysis for lineær static circuits, resistance, capacitance, inductance, diodes, MOSFET transistor as a switch, operational amplifiers, transient analysis, binary arithmetic, boolean algebra, logic gates, combinatorial and sequential digital circuits. The other important feature of this course is, it covers both BJT based circuits and MOSFET based circuits parallel so that similarities and performance differences between these two classes of circuits are understandable. Moreover, the BJT based circuits discussed here can be easily constricted on bread board to verify their characteristic through measurement. On the other hand, analysis of the MOSFET based circuits provides the necessary foundation for Analog VLSI circuit/system design, a next level course in Microelectronics and VLSI Design. ",
    "course_image": "https://i1.wp.com/www.techinpost.com/wp-content/uploads/How-do-Analog-Digital-Circuits-Shape-the-Electronics-Industry.jpg?fit=1080%2C720&ssl=1",
    "course_content": ""
  },
  {
    "course_id": "6357c0e18c6b331030af5a2b",
    "category_id": "04",
    "course_title": "Engineering Electromagnetics",
    "course_duration": 11,
    "course_details": "Applied electromagnetics for engineers is designed to be an application oriented course while covering all the theoretical concepts of modern electromagnetics. It begins by an in-depth study of transmission lines which play an important role in high-speed digital design and signal integrity of PCBs. After a brief review of necessary mathematics (coordinate systems, vector analysis, and vector fields), the course covers analytical and numerical solution of Laplace's and Poisson's equations, quasi-static analysis of capacitors and skin effect, inductance calculations, and Maxwell equations. Wave propagation in free-space, ferrites, and peroidic media are covered along with waveguides (rectangular, planar dielectric, and optical fibers) and antennas. The course includes a balance between theory, programming, and applications. Several case studies will be discussed.Intended Audience :UG 2nd, 3rd YearPrerequisites : Electricity and magnetism at the level of high-school, Vector analysis, Differential and integral calculus, programming using Matlab (preferable)Industries that will recognize this course :Core UG course that is necessary for follow up courses on high speed digital design, RF and microwave, fiber optics, antennas. Companies/Industry such as Sterlite, Analog Devices, GE, Comsol India, Matlab, Texas Instruments, Defense labs etc will be interested.",
    "course_image": "https://cdn.mwallpapers.com/photos/celebrities/sci-fi/steampunk-gears-android-iphone-desktop-hd-backgrounds-wallpapers-1080p-4khd-wallpapers-desktop-background-android-iphone-1080p-4k-rwwrq.jpg",
    "course_content": ""
  },
  {
    "course_id": "6357c0e18167b2baaf83e484",
    "category_id": "05",
    "course_title": "Electrical Systems",
    "course_duration": 5,
    "course_details": "This course familiarizes you with standards and policies of the electric utility industry, and provides you with basic vocabulary used in the business. It introduces the electric power system, from generation of the electricity all the way to the wall plug. You will learn about the segments of the system, and common components like power cables and transformers. This course is for individuals considering a career in the energy field (who have a high school diploma, at minimum, and basic knowledge of mathematics), and existing energy sector employees with less than three years of experience who have not completed similar training and would benefit from a course of foundational industry concepts. The course is a combination of online lectures, videos, readings and discussions. This is the first course in the Energy Production, Distribution & Safety specialization that explores various facets of the power sector, and features a culminating project involving creation of a roadmap to achieve a self-established, energy-related professional goal. To learn more about the specialization, check out a video overview at https://www.youtube.com/watch?v=2Yh9qIYiUDk.",
    "course_image": "https://www.proaaci.com/wp-content/uploads/2015/12/electrical.jpeg",
    "course_content": ""
  },
  {
    "course_id": "6357c0e1650b26fa5e916bf0",
    "category_id": "05",
    "course_title": "Automotive Emissions",
    "course_duration": 2,
    "course_details": "The Emissions Test Preparation Training is a non-credit 20-hour class designed to help an auto technician prepare for the Utah County Emissions Certification. In this course you will gain a basic knowledge of the automobile engine mechanical, cooling, fuel, electrical, and emission control systems. The material covered in this course will prepare the technician for the Utah County Emissions Test. Students need to be able to show that they have some mechanic experience. All students must have a valid driver's license, and is recommended to have a 10th grade competency level in reading and English. You will join an exclusive group of graduates who benefit from a commitment to excellence shared by everyone at the school. From instructors who deliver a relevant, industry-driven curriculum to academic and career counselors focused on ensuring you have the tools you need to succeed, we all share the same goal: your success as a student.",
    "course_image": "https://as1.ftcdn.net/v2/jpg/02/56/21/80/1000_F_256218058_X5y3wWpBuHs6IWTijDZ6FmIyVW3YlqD8.jpg",
    "course_content": ""
  },
  {
    "course_id": "6357c0e168011b1e10a09125",
    "category_id": "05",
    "course_title": "Brake Systems",
    "course_duration": 9,
    "course_details": "It's important to how brake systems work, and ATC's Brake Systems & ABS Course provides aspiring professionals with that very training—in a flexible, online format. Through theory and practical exercises, students will learn the basic principles of braking. Although ATC's brake systems course is entirely online, instructors are readily available to give you the same quality of academic support that you'd receive in the classroom. You can start the course the same day you are admitted, and have up to one year to complete it. This allows students to create their own schedule and work at their own pace. It includes the operation and function of each and every component in ABS system. It descries how ABS-ECU manipulates the actuators and based on which measurements and from which sensors, ow the latter sensors operates and how they measure data, what are the calculations done by ECU and based on which equations. In addition, it figures how all the components sensors, ECU and actuators operate together and their results on the driving ability and the vehicle. Moreover, the course shows the exact electrical and fluid circuit flow and their consequences.",
    "course_image": "https://www.meritor.com/-/media/Meritor/Products/Headers/elsa-225h-product-header.ashx",
    "course_content": ""
  },
  {
    "course_id": "6357c0e1861323cdc5f68208",
    "category_id": "05",
    "course_title": "Suspension and Steering",
    "course_duration": 11,
    "course_details": "At Fast Lane Automotive Training, we give a vehicle's steering and suspension systems the time and attention they deserve as the second and third most vital systems in an automobile. Seriously, after the braking system, steering and suspension are next in line because they play a huge role in controlling a vehicle's direction and stability while in motion. In our Steering & Suspension training we'll introduce the basic principles of vehicle steering and suspension, including wheel alignment and tire sizing, using real-world automobiles. We'll cover the disassembly and reassembly of suspension and steering system components and show students how to effectively use computerized systems for tire alignments, balancing and changing. Our Steering & Suspension training helps to prepare students to take the steering and suspension certification test from the National Institute for Automotive Service Excellence (A.S.E.). With that certification achieved, Fast Lane will help with job placement through our partner agencies. Qualified students will even receive sponsorship for certification testing.",
    "course_image": "https://st2.depositphotos.com/4867809/8048/i/950/depositphotos_80480860-stock-photo-driving-hands-steering-wheel.jpg",
    "course_content": ""
  }
]